; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c3-s6-p15-a2)
(:domain logistics-strips)
(:objects a0 a1 
          c0 c1 c2 
          t0 t1 t2 
          l0-0 l0-1 l0-2 l0-3 l0-4 l0-5 l1-0 l1-1 l1-2 l1-3 l1-4 l1-5 l2-0 l2-1 l2-2 l2-3 l2-4 l2-5 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l0-4)
    (in-city  l0-4 c0)
    (LOCATION l0-5)
    (in-city  l0-5 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l1-4)
    (in-city  l1-4 c1)
    (LOCATION l1-5)
    (in-city  l1-5 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (LOCATION l2-4)
    (in-city  l2-4 c2)
    (LOCATION l2-5)
    (in-city  l2-5 c2)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (OBJ p14)
    (at t0 l0-2)
    (at t1 l1-0)
    (at t2 l2-2)
    (at p0 l0-4)
    (at p1 l1-1)
    (at p2 l0-4)
    (at p3 l2-0)
    (at p4 l2-3)
    (at p5 l1-4)
    (at p6 l2-2)
    (at p7 l1-0)
    (at p8 l2-2)
    (at p9 l1-0)
    (at p10 l1-4)
    (at p11 l1-2)
    (at p12 l0-3)
    (at p13 l1-4)
    (at p14 l0-2)
    (at a0 l0-0)
    (at a1 l1-0)
)
(:goal
    (and
        (at p0 l1-3)
        (at p1 l1-0)
        (at p2 l2-5)
        (at p3 l2-2)
        (at p4 l0-5)
        (at p5 l2-1)
        (at p6 l1-5)
        (at p7 l1-0)
        (at p8 l0-4)
        (at p9 l2-2)
        (at p10 l1-4)
        (at p11 l0-3)
        (at p12 l2-1)
        (at p13 l0-0)
        (at p14 l2-1)
    )
)

  (:constraints
    (and
      (always (not (in p1 a0)))
      (always (not (in p1 a1)))
      (always (not (in p10 a0)))
      (always (not (in p10 a1)))
      (always (not (in p3 a0)))
      (always (not (in p3 a1)))
      (always (not (in p7 a0)))
      (always (not (in p7 a1)))
    )
  )
)

; plan
1. (fly-airplane a1 l1-0 l2-0)
   deleted: (at a1 l1-0)
   added: (at a1 l2-0)
   goals met: 2 of 15
2. (load-truck p8 t2 l2-2)
   deleted: (at p8 l2-2)
   added: (in p8 t2)
   goals met: 2 of 15
3. (load-truck p6 t2 l2-2)
   deleted: (at p6 l2-2)
   added: (in p6 t2)
   goals met: 2 of 15
4. (load-truck p14 t0 l0-2)
   deleted: (at p14 l0-2)
   added: (in p14 t0)
   goals met: 2 of 15
5. (fly-airplane a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 2 of 15
6. (drive-truck t1 l1-0 l1-4 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-4)
   goals met: 2 of 15
7. (drive-truck t0 l0-2 l0-5 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-5)
   goals met: 2 of 15
8. (drive-truck t2 l2-2 l2-3 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-3)
   goals met: 2 of 15
9. (load-airplane p9 a0 l1-0)
   deleted: (at p9 l1-0)
   added: (in p9 a0)
   goals met: 2 of 15
10. (load-truck p5 t1 l1-4)
   deleted: (at p5 l1-4)
   added: (in p5 t1)
   goals met: 2 of 15
11. (load-truck p13 t1 l1-4)
   deleted: (at p13 l1-4)
   added: (in p13 t1)
   goals met: 2 of 15
12. (fly-airplane a1 l2-0 l1-0)
   deleted: (at a1 l2-0)
   added: (at a1 l1-0)
   goals met: 2 of 15
13. (load-truck p4 t2 l2-3)
   deleted: (at p4 l2-3)
   added: (in p4 t2)
   goals met: 2 of 15
14. (drive-truck t1 l1-4 l1-5 c1)
   deleted: (at t1 l1-4)
   added: (at t1 l1-5)
   goals met: 2 of 15
15. (fly-airplane a0 l1-0 l2-0)
   deleted: (at a0 l1-0)
   added: (at a0 l2-0)
   goals met: 2 of 15
16. (drive-truck t0 l0-5 l0-4 c0)
   deleted: (at t0 l0-5)
   added: (at t0 l0-4)
   goals met: 2 of 15
17. (drive-truck t2 l2-3 l2-5 c2)
   deleted: (at t2 l2-3)
   added: (at t2 l2-5)
   goals met: 2 of 15
18. (unload-airplane p9 a0 l2-0)
   deleted: (in p9 a0)
   added: (at p9 l2-0)
   goals met: 2 of 15
19. (load-truck p2 t0 l0-4)
   deleted: (at p2 l0-4)
   added: (in p2 t0)
   goals met: 2 of 15
20. (load-truck p0 t0 l0-4)
   deleted: (at p0 l0-4)
   added: (in p0 t0)
   goals met: 2 of 15
21. (drive-truck t1 l1-5 l1-2 c1)
   deleted: (at t1 l1-5)
   added: (at t1 l1-2)
   goals met: 2 of 15
22. (load-truck p11 t1 l1-2)
   deleted: (at p11 l1-2)
   added: (in p11 t1)
   goals met: 2 of 15
23. (drive-truck t0 l0-4 l0-3 c0)
   deleted: (at t0 l0-4)
   added: (at t0 l0-3)
   goals met: 2 of 15
24. (drive-truck t2 l2-5 l2-0 c2)
   deleted: (at t2 l2-5)
   added: (at t2 l2-0)
   goals met: 2 of 15
25. (drive-truck t1 l1-2 l1-5 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-5)
   goals met: 2 of 15
26. (load-truck p12 t0 l0-3)
   deleted: (at p12 l0-3)
   added: (in p12 t0)
   goals met: 2 of 15
27. (unload-truck p8 t2 l2-0)
   deleted: (in p8 t2)
   added: (at p8 l2-0)
   goals met: 2 of 15
28. (unload-truck p6 t2 l2-0)
   deleted: (in p6 t2)
   added: (at p6 l2-0)
   goals met: 2 of 15
29. (unload-truck p4 t2 l2-0)
   deleted: (in p4 t2)
   added: (at p4 l2-0)
   goals met: 2 of 15
30. (load-truck p9 t2 l2-0)
   deleted: (at p9 l2-0)
   added: (in p9 t2)
   goals met: 2 of 15
31. (load-truck p3 t2 l2-0)
   deleted: (at p3 l2-0)
   added: (in p3 t2)
   goals met: 2 of 15
32. (load-airplane p8 a0 l2-0)
   deleted: (at p8 l2-0)
   added: (in p8 a0)
   goals met: 2 of 15
33. (load-airplane p6 a0 l2-0)
   deleted: (at p6 l2-0)
   added: (in p6 a0)
   goals met: 2 of 15
34. (load-airplane p4 a0 l2-0)
   deleted: (at p4 l2-0)
   added: (in p4 a0)
   goals met: 2 of 15
35. (drive-truck t0 l0-3 l0-0 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-0)
   goals met: 2 of 15
36. (drive-truck t2 l2-0 l2-2 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-2)
   goals met: 2 of 15
37. (drive-truck t1 l1-5 l1-1 c1)
   deleted: (at t1 l1-5)
   added: (at t1 l1-1)
   goals met: 2 of 15
38. (unload-truck p2 t0 l0-0)
   deleted: (in p2 t0)
   added: (at p2 l0-0)
   goals met: 2 of 15
39. (unload-truck p14 t0 l0-0)
   deleted: (in p14 t0)
   added: (at p14 l0-0)
   goals met: 2 of 15
40. (unload-truck p12 t0 l0-0)
   deleted: (in p12 t0)
   added: (at p12 l0-0)
   goals met: 2 of 15
41. (unload-truck p0 t0 l0-0)
   deleted: (in p0 t0)
   added: (at p0 l0-0)
   goals met: 2 of 15
42. (unload-truck p9 t2 l2-2)
   deleted: (in p9 t2)
   added: (at p9 l2-2)
   goals met: 3 of 15
43. (unload-truck p3 t2 l2-2)
   deleted: (in p3 t2)
   added: (at p3 l2-2)
   goals met: 4 of 15
44. (load-truck p1 t1 l1-1)
   deleted: (at p1 l1-1)
   added: (in p1 t1)
   goals met: 4 of 15
45. (fly-airplane a0 l2-0 l0-0)
   deleted: (at a0 l2-0)
   added: (at a0 l0-0)
   goals met: 4 of 15
46. (drive-truck t2 l2-2 l2-5 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-5)
   goals met: 4 of 15
47. (drive-truck t1 l1-1 l1-5 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-5)
   goals met: 4 of 15
48. (unload-airplane p8 a0 l0-0)
   deleted: (in p8 a0)
   added: (at p8 l0-0)
   goals met: 4 of 15
49. (unload-airplane p4 a0 l0-0)
   deleted: (in p4 a0)
   added: (at p4 l0-0)
   goals met: 4 of 15
50. (load-airplane p2 a0 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 a0)
   goals met: 4 of 15
51. (load-airplane p14 a0 l0-0)
   deleted: (at p14 l0-0)
   added: (in p14 a0)
   goals met: 4 of 15
52. (load-airplane p12 a0 l0-0)
   deleted: (at p12 l0-0)
   added: (in p12 a0)
   goals met: 4 of 15
53. (load-airplane p0 a0 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 a0)
   goals met: 4 of 15
54. (load-truck p8 t0 l0-0)
   deleted: (at p8 l0-0)
   added: (in p8 t0)
   goals met: 4 of 15
55. (load-truck p4 t0 l0-0)
   deleted: (at p4 l0-0)
   added: (in p4 t0)
   goals met: 4 of 15
56. (fly-airplane a0 l0-0 l2-0)
   deleted: (at a0 l0-0)
   added: (at a0 l2-0)
   goals met: 4 of 15
57. (drive-truck t2 l2-5 l2-0 c2)
   deleted: (at t2 l2-5)
   added: (at t2 l2-0)
   goals met: 4 of 15
58. (drive-truck t1 l1-5 l1-0 c1)
   deleted: (at t1 l1-5)
   added: (at t1 l1-0)
   goals met: 4 of 15
59. (unload-airplane p2 a0 l2-0)
   deleted: (in p2 a0)
   added: (at p2 l2-0)
   goals met: 4 of 15
60. (unload-airplane p14 a0 l2-0)
   deleted: (in p14 a0)
   added: (at p14 l2-0)
   goals met: 4 of 15
61. (unload-airplane p12 a0 l2-0)
   deleted: (in p12 a0)
   added: (at p12 l2-0)
   goals met: 4 of 15
62. (drive-truck t0 l0-0 l0-5 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-5)
   goals met: 4 of 15
63. (unload-truck p5 t1 l1-0)
   deleted: (in p5 t1)
   added: (at p5 l1-0)
   goals met: 4 of 15
64. (unload-truck p13 t1 l1-0)
   deleted: (in p13 t1)
   added: (at p13 l1-0)
   goals met: 4 of 15
65. (unload-truck p11 t1 l1-0)
   deleted: (in p11 t1)
   added: (at p11 l1-0)
   goals met: 4 of 15
66. (unload-truck p4 t0 l0-5)
   deleted: (in p4 t0)
   added: (at p4 l0-5)
   goals met: 5 of 15
67. (load-truck p2 t2 l2-0)
   deleted: (at p2 l2-0)
   added: (in p2 t2)
   goals met: 5 of 15
68. (fly-airplane a0 l2-0 l1-0)
   deleted: (at a0 l2-0)
   added: (at a0 l1-0)
   goals met: 5 of 15
69. (load-airplane p5 a1 l1-0)
   deleted: (at p5 l1-0)
   added: (in p5 a1)
   goals met: 5 of 15
70. (drive-truck t0 l0-5 l0-4 c0)
   deleted: (at t0 l0-5)
   added: (at t0 l0-4)
   goals met: 5 of 15
71. (unload-airplane p6 a0 l1-0)
   deleted: (in p6 a0)
   added: (at p6 l1-0)
   goals met: 5 of 15
72. (unload-airplane p0 a0 l1-0)
   deleted: (in p0 a0)
   added: (at p0 l1-0)
   goals met: 5 of 15
73. (fly-airplane a1 l1-0 l2-0)
   deleted: (at a1 l1-0)
   added: (at a1 l2-0)
   goals met: 5 of 15
74. (load-airplane p13 a0 l1-0)
   deleted: (at p13 l1-0)
   added: (in p13 a0)
   goals met: 5 of 15
75. (load-airplane p11 a0 l1-0)
   deleted: (at p11 l1-0)
   added: (in p11 a0)
   goals met: 5 of 15
76. (unload-truck p1 t1 l1-0)
   deleted: (in p1 t1)
   added: (at p1 l1-0)
   goals met: 6 of 15
77. (unload-truck p8 t0 l0-4)
   deleted: (in p8 t0)
   added: (at p8 l0-4)
   goals met: 7 of 15
78. (load-truck p6 t1 l1-0)
   deleted: (at p6 l1-0)
   added: (in p6 t1)
   goals met: 7 of 15
79. (load-truck p0 t1 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 t1)
   goals met: 7 of 15
80. (fly-airplane a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 7 of 15
81. (unload-airplane p5 a1 l2-0)
   deleted: (in p5 a1)
   added: (at p5 l2-0)
   goals met: 7 of 15
82. (drive-truck t0 l0-4 l0-3 c0)
   deleted: (at t0 l0-4)
   added: (at t0 l0-3)
   goals met: 7 of 15
83. (load-truck p14 t2 l2-0)
   deleted: (at p14 l2-0)
   added: (in p14 t2)
   goals met: 7 of 15
84. (load-truck p12 t2 l2-0)
   deleted: (at p12 l2-0)
   added: (in p12 t2)
   goals met: 7 of 15
85. (drive-truck t1 l1-0 l1-5 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-5)
   goals met: 7 of 15
86. (unload-airplane p13 a0 l0-0)
   deleted: (in p13 a0)
   added: (at p13 l0-0)
   goals met: 8 of 15
87. (load-truck p5 t2 l2-0)
   deleted: (at p5 l2-0)
   added: (in p5 t2)
   goals met: 8 of 15
88. (unload-truck p6 t1 l1-5)
   deleted: (in p6 t1)
   added: (at p6 l1-5)
   goals met: 9 of 15
89. (unload-airplane p11 a0 l0-0)
   deleted: (in p11 a0)
   added: (at p11 l0-0)
   goals met: 9 of 15
90. (drive-truck t2 l2-0 l2-5 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-5)
   goals met: 9 of 15
91. (drive-truck t0 l0-3 l0-0 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-0)
   goals met: 9 of 15
92. (drive-truck t1 l1-5 l1-3 c1)
   deleted: (at t1 l1-5)
   added: (at t1 l1-3)
   goals met: 9 of 15
93. (unload-truck p2 t2 l2-5)
   deleted: (in p2 t2)
   added: (at p2 l2-5)
   goals met: 10 of 15
94. (load-truck p11 t0 l0-0)
   deleted: (at p11 l0-0)
   added: (in p11 t0)
   goals met: 10 of 15
95. (unload-truck p0 t1 l1-3)
   deleted: (in p0 t1)
   added: (at p0 l1-3)
   goals met: 11 of 15
96. (drive-truck t2 l2-5 l2-1 c2)
   deleted: (at t2 l2-5)
   added: (at t2 l2-1)
   goals met: 11 of 15
97. (drive-truck t0 l0-0 l0-3 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-3)
   goals met: 11 of 15
98. (unload-truck p5 t2 l2-1)
   deleted: (in p5 t2)
   added: (at p5 l2-1)
   goals met: 12 of 15
99. (unload-truck p14 t2 l2-1)
   deleted: (in p14 t2)
   added: (at p14 l2-1)
   goals met: 13 of 15
100. (unload-truck p12 t2 l2-1)
   deleted: (in p12 t2)
   added: (at p12 l2-1)
   goals met: 14 of 15
101. (unload-truck p11 t0 l0-3)
   deleted: (in p11 t0)
   added: (at p11 l0-3)
   goals met: 15 of 15
